Tekla Open API Reference for Tekla Structures 2025
ShellEnumerator.Current Property
 Gets the current shell.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object Current { get; }
Public ReadOnly Property Current As Object
	Get
Property Value
Type: Object
Implements
IEnumerator.Current
See Also
Reference
ShellEnumerator Class
Tekla.Structures.Solid Namespace